import * as yup from "yup";

export const FormSchema = yup.object().shape({
  email: yup
    .string()
    .email("\u2716  Переконайтеся, що ви написали свою пошту вірно")
    .matches(
      /^[A-Za-z0-9-_.+]{1,50}@(?=.{4,50}$)[A-Za-z0-9][A-Za-z0-9-.]*\.[A-Za-z0-9]{2,}$/,
      "\u2716  Переконайтеся, що ви написали свою пошту вірно"
    )
    .required("Це поле є обов'язковим"),
  password: yup
    .string()
    .min(8, "\u2716 Пароль повинен містити принаймні 8 символів")
    .max(25, "\u2716 Пароль повинен містити не більше 25 символів")
    .matches(
      /^[A-Za-z0-9~`!@#$%^&*()_\-+={[}\]|:;'<,>.?/]*$/,
      "\u2716  Пароль може містити лише літери, цифри або наступні символи ~`!@#$%^&*()_-+={[}]|:;'<,>.?/"
    )

    .test(
      "not-only-digits",
      "\u2716  Пароль не може бути лише з цифр",
      function (value) {
        return !/^\d+$/.test(value);
      }
    )
    .required("Це поле є обов'язковим"),
});
