export const  questions = [
    {
      question: "Що робити, якщо моє замовлення затримується?",
      answer: `Якщо ви не отримали замовлення у визначений час, перевірте, чи
      не пропустили ви СМС або повідомлення про доставку від
      поштової служби. Можливо, посилка вже чекає на вас у
      відділенні. Якщо ви все ще не можете знайти свою посилку,
      зв'яжіться з нами на наступний день після очікуваної дати
      доставки. Наш телефон, Telegram і Viber: +38 (066) 4000 000.`
    },
    {
      question: "Коли моє замовлення доставлять?",
      answer: `Після підтвердження замовлення термін доставки 1-4 робочі дні по Україні.`
    },
    {
      question: "Скільки коштує доставка?",
      answer: `Доставка оплачується за тарифами пошти. Ви можете уточнити
      вартість в нашого менеджера під час підтвердження замовлення.`
    },
    {
      question: "Як зробити замовлення?",
      answer: `На сайті: натисніть кнопку "Додати в кошик" поруч із товаром.
      Потім натисніть значок кошика у правій верхній частині екрана.
      Натисніть кнопку "Оформити замовлення". Введіть ваші дані,
      виберіть тип доставки та оплати та натисніть кнопку “Замовити”.
      Після цього зв'яжеться з вами наш менеджер і уточнить деталі замовлення.`
    },
    {
      question: "Як сплатити замовлення?",
      answer: `Оплата при замовленні. Оплатити можна через Приват24 чи LiqPay.
      Реквізити для оплати ви побачите при оформленні замовлення на
      сайті, якщо вибрати оплату на карту. Також ми надішлемо вам
      реквізити у Viber або СМС, після того як уточнимо замовлення.`
    },
    {
      question: "Я можу змінити замовлення?",
      answer: `Якщо ми ще не надіслали замовлення, ви можете змінити його,
      зв'язавшись з нами.`
    },
    {
      question: "Мені прийшов не той товар, який я замовляв",
      answer: `Якщо ми ще не надіслали замовлення, ви можете змінити його,
      зв'язавшись з нами.`
    },
  ];